  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/setup-tf` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/dc959846-210e-4d9d-b60f-b88ccc2f9e98/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.vnet.azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.0.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "my-secure-vnet"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.vnet.module.firewall.azurerm_firewall.firewall will be created
+ resource "azurerm_firewall" "firewall" {
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "my-secure-firewall"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + sku_name            = "AZFW_VNet"
    + sku_tier            = "Standard"
    + threat_intel_mode   = (known after apply)

    + ip_configuration {
        + name                 = "my-secure-firewall-ip-config"
        + private_ip_address   = (known after apply)
        + public_ip_address_id = (known after apply)
        + subnet_id            = (known after apply)
      }
  }

# module.vnet.module.subnet.azurerm_subnet.subnet will be created
+ resource "azurerm_subnet" "subnet" {
    + address_prefixes                               = [
        + "10.0.0.0/24",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "AzureFirewallSubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "my-secure-vnet"
  }

# module.vnet.module.firewall.module.ip.azurerm_public_ip.public_ip will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus"
    + name                    = "my-secure-firewall-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
  }

Plan: 4 to add, 0 to change, 0 to destroy.
module.vnet.azurerm_virtual_network.vnet: Creating...
module.vnet.azurerm_virtual_network.vnet: Creation complete after 6s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet]
module.vnet.module.firewall.module.ip.azurerm_public_ip.public_ip: Creating...
module.vnet.module.subnet.azurerm_subnet.subnet: Creating...
module.vnet.module.firewall.module.ip.azurerm_public_ip.public_ip: Creation complete after 3s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/my-secure-firewall-ip]
module.vnet.module.subnet.azurerm_subnet.subnet: Creation complete after 6s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/my-secure-vnet/subnets/AzureFirewallSubnet]
module.vnet.module.firewall.azurerm_firewall.firewall: Creating...
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [10s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [20s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [30s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [40s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [50s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m0s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m10s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m20s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m30s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m40s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [1m50s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [2m0s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [2m10s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Still creating... [2m20s elapsed]
module.vnet.module.firewall.azurerm_firewall.firewall: Creation complete after 2m24s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/azureFirewalls/my-secure-firewall]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
```

  </details>